Repository: Bennymens/ABOD-Website
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de, fr

source: Markets
de: Märkte
fr: Marchés

source: Projects
de: Projekte
fr: Projets

source: Insights
de: Einblicke
fr: Perspectives

source: About
de: Über uns
fr: À propos

source: Careers
de: Karriere
fr: Carrières

source: News
de: Neuigkeiten
fr: Actualités

source: Search
de: Suchen
fr: Rechercher

source: ← Back to services
de: ← Zurück zu Dienstleistungen
fr: ← Retour aux services

source: Architecture and Design
de: Architektur und Design
fr: Architecture et Design

source: Creating iconic, user-centric designs across a wide range of project types, including commercial, institutional, residential, scientific, industrial, and hospitality environments.
de: Wir schaffen ikonische, benutzerzentrierte Designs für eine breite Palette von Projekttypen, einschließlich kommerzieller, institutioneller, privater, wissenschaftlicher, industrieller und gastgewerblicher Umgebungen.
fr: Créer des designs emblématiques et centrés sur l'utilisateur pour une large gamme de types de projets, y compris des environnements commerciaux, institutionnels, résidentiels, scientifiques, industriels et hôteliers.

source: Our work encompasses both new builds and refurbishments, with particular expertise in designing teaching and research spaces, as well as environments that prioritize inclusivity, accessibility, and long-term adaptability.
de: Unsere Arbeit umfasst sowohl Neubauten als auch Sanierungen, mit besonderer Expertise im Design von Lehr- und Forschungsräumen sowie Umgebungen, die Inklusivität, Zugänglichkeit und langfristige Anpassungsfähigkeit priorisieren.
fr: Notre travail englobe à la fois les nouvelles constructions et les rénovations, avec une expertise particulière dans la conception d'espaces d'enseignement et de recherche, ainsi que d'environnements qui privilégient l'inclusion, l'accessibilité et l'adaptabilité à long terme.

source: We focus on delivering functional, inspiring spaces that elevate user experience while meeting the unique needs of every client and community we serve.
de: Wir konzentrieren uns darauf, funktionale, inspirierende Räume zu schaffen, die das Benutzererlebnis verbessern und gleichzeitig die einzigartigen Bedürfnisse jedes Kunden und jeder Gemeinschaft erfüllen, die wir betreuen.
fr: Nous nous concentrons sur la création d'espaces fonctionnels et inspirants qui améliorent l'expérience utilisateur tout en répondant aux besoins uniques de chaque client et communauté que nous servons.

source: Our Architecture Specialisms
de: Unsere Architektur-Spezialisierungen
fr: Nos Spécialisations en Architecture

source: We bring deep expertise across multiple sectors, delivering tailored solutions that combine innovation, functionality, and timeless design.
de: Wir bringen tiefgreifende Expertise in mehreren Sektoren ein und liefern maßgeschneiderte Lösungen, die Innovation, Funktionalität und zeitloses Design kombinieren.
fr: Nous apportons une expertise approfondie dans plusieurs secteurs, en proposant des solutions sur mesure qui combinent innovation, fonctionnalité et design intemporel.

source: Residential / Housing
de: Wohnen / Wohnungsbau
fr: Résidentiel / Logement

source: Hospitality / Leisure
de: Gastgewerbe / Freizeit
fr: Hôtellerie / Loisirs

source: Civic
de: Öffentlich
fr: Civique

source: View All Residential Projects
de: Alle Wohnprojekte ansehen
fr: Voir Tous les Projets Résidentiels

source: View All Commercial Projects
de: Alle Gewerbeprojekte ansehen
fr: Voir Tous les Projets Commerciaux

source: View All Hospitality Projects
de: Alle Gastgewerbeprojekte ansehen
fr: Voir Tous les Projets Hôteliers

source: View All Civic Projects
de: Alle öffentlichen Projekte ansehen
fr: Voir Tous les Projets Civiques

source: Explore More Architecture Projects
de: Weitere Architekturprojekte erkunden
fr: Explorer Plus de Projets d'Architecture

source: Discover a selection of our most impactful projects that showcase innovation, sustainability, and design excellence.
de: Entdecken Sie eine Auswahl unserer wirkungsvollsten Projekte, die Innovation, Nachhaltigkeit und Design-Exzellenz präsentieren.
fr: Découvrez une sélection de nos projets les plus impactants qui mettent en valeur l'innovation, la durabilité et l'excellence du design.

source: See All
de: Alle anzeigen
fr: Voir Tout

source: Designing sustainable places and systems. We work across markets to make long-term, people-centred change.
de: Wir gestalten nachhaltige Orte und Systeme. Wir arbeiten marktübergreifend, um langfristige, menschenzentrierte Veränderungen zu bewirken.
fr: Concevoir des lieux et des systèmes durables. Nous travaillons dans tous les marchés pour apporter des changements durables centrés sur les personnes.

source: Explore
de: Erkunden
fr: Explorer

source: Company
de: Unternehmen
fr: Entreprise

source: Follow us
de: Folgen Sie uns
fr: Suivez-nous

source: Advisory and Planning
de: Beratung und Planung
fr: Conseil et Planification

source: 3D Modeling and Visualization
de: 3D-Modellierung und Visualisierung
fr: Modélisation et Visualisation 3D

source: 3D modeling and Visualization
de: 3D-Modellierung und Visualisierung
fr: Modélisation et Visualisation 3D

source: Urban Design & Masterplanning
de: Städtebau und Masterplanung
fr: Design Urbain et Planification Maîtresse

source: Sustainability & Environmental Solutions
de: Nachhaltigkeit und Umweltlösungen
fr: Durabilité et Solutions Environnementales

source: Digital innovation and Experimental Design
de: Digitale Innovation und Experimentelles Design
fr: Innovation Numérique et Design Expérimental

source: Urban Design and Masterplanning
de: Städtebau und Masterplanung
fr: Design Urbain et Planification Maîtresse

source: Sustainability and Environmental Solutions
de: Nachhaltigkeit und Umweltlösungen
fr: Durabilité et Solutions Environnementales

source: Digital Innovation and Experimental Design
de: Digitale Innovation und Experimentelles Design
fr: Innovation Numérique et Design Expérimental

source: Interior and Landscape Design
de: Innenarchitektur und Landschaftsgestaltung
fr: Design d'Intérieur et de Paysage

source: Project Management
de: Projektmanagement
fr: Gestion de Projet

source: Specialized Services
de: Spezialisierte Dienstleistungen
fr: Services Spécialisés

source: We are making innovation sustainable
de: Wir machen Innovation nachhaltig
fr: Nous rendons l'innovation durable

source: Engineering for people and the planet
de: Ingenieurtechnik für Menschen und den Planeten
fr: Ingénierie pour les personnes et la planète

source: Our experts are leading the way
de: Unsere Experten weisen den Weg
fr: Nos experts montrent la voie

source: Expert architecture and design solutions for diverse projects
de: Experten-Architektur- und Designlösungen für vielfältige Projekte
fr: Solutions d'architecture et de design expertes pour des projets diversifiés

source: Insights and Thought Leadership
de: Einblicke und Vordenkerrolle
fr: Perspectives et Leadership d'Opinion

source: Latest thinking on industry trends
de: Neueste Erkenntnisse zu Branchentrends
fr: Dernières réflexions sur les tendances de l'industrie

source: Explore Our Projects
de: Unsere Projekte erkunden
fr: Explorer Nos Projets

source: Discover innovative solutions
de: Innovative Lösungen entdecken
fr: Découvrir des solutions innovantes

source: Markets We Serve
de: Märkte, Die Wir Bedienen
fr: Marchés Que Nous Servons

source: Specialized expertise across sectors
de: Spezialisierte Expertise über Sektoren hinweg
fr: Expertise spécialisée dans tous les secteurs

source: Learn More
de: Mehr erfahren
fr: En Savoir Plus

source: Read More
de: Mehr lesen
fr: Lire Plus

source: View All
de: Alle anzeigen
fr: Voir Tout

source: Back
de: Zurück
fr: Retour

source: Home
de: Startseite
fr: Accueil

source: Send
de: Senden
fr: Envoyer

source: Submit
de: Absenden
fr: Soumettre

source: What We Do
de: Was Wir Tun
fr: Ce Que Nous Faisons

source: Our Services
de: Unsere Dienstleistungen
fr: Nos Services

source: Who We Are
de: Wer Wir Sind
fr: Qui Nous Sommes

source: Our Story
de: Unsere Geschichte
fr: Notre Histoire

source: Our Mission
de: Unsere Mission
fr: Notre Mission

source: Our Values
de: Unsere Werte
fr: Nos Valeurs

source: Our Team
de: Unser Team
fr: Notre Équipe

source: Get in Touch
de: Kontaktieren Sie Uns
fr: Contactez-Nous

source: Contact Us
de: Kontakt
fr: Nous Contacter

source: Name
fr: Nom

source: Our Projects
de: Unsere Projekte
fr: Nos Projets

source: Featured Projects
de: Vorgestellte Projekte
fr: Projets en Vedette

source: View Project
de: Projekt ansehen
fr: Voir le Projet

source: All Projects
de: Alle Projekte
fr: Tous les Projets

source: Explore our services across the built
de: Erkunden Sie unsere Dienstleistungen in der bebauten
fr: Explorez nos services à travers le bâti

source: environments
de: Umgebung
fr: environnements

source: Designing sustainable places and systems — making long-term, people-centred change.
de: Nachhaltige Orte und Systeme gestalten — langfristige, menschenzentrierte Veränderungen bewirken.
fr: Concevoir des lieux et des systèmes durables — apporter des changements durables centrés sur les personnes.

source: search services
de: Dienstleistungen suchen
fr: rechercher des services

source: Search results for
de: Suchergebnisse für
fr: Résultats de recherche pour

source: Issue
de: Thema
fr: Question

source: We explore some of the biggest questions facing the built and natural environments.
de: Wir untersuchen einige der größten Fragen, mit denen die gebaute und natürliche Umwelt konfrontiert ist.
fr: Nous explorons certaines des plus grandes questions auxquelles sont confrontés les environnements bâtis et naturels.

source: View more issues
de: Mehr Themen anzeigen
fr: Voir plus de questions

source: How do we create climate-resilient, energy-efficient buildings?
de: Wie schaffen wir klimaresistente, energieeffiziente Gebäude?
fr: Comment créer des bâtiments résilients au climat et économes en énergie ?

source: How do we tackle high-end, technically challenging developments?
de: Wie gehen wir mit hochwertigen, technisch anspruchsvollen Entwicklungen um?
fr: Comment relever les défis des développements haut de gamme et techniquement exigeants ?

source: How do we Prioritize inclusive, user-focused solutions?
de: Wie priorisieren wir inklusive, benutzerzentrierte Lösungen?
fr: Comment prioriser des solutions inclusives et centrées sur l'utilisateur ?

source: Expert guidance through feasibility studies, business and investor advisory, urban and regional planning, policy development, and stakeholder engagement to support sustainable growth and informed decision-making.
de: Expertenberatung durch Machbarkeitsstudien, Unternehmens- und Investorenberatung, Stadt- und Regionalplanung, Politikentwicklung und Stakeholder-Engagement zur Unterstützung nachhaltigen Wachstums und fundierter Entscheidungsfindung.
fr: Conseils d'experts à travers des études de faisabilité, des conseils aux entreprises et aux investisseurs, de la planification urbaine et régionale, du développement de politiques et de l'engagement des parties prenantes pour soutenir une croissance durable et une prise de décision éclairée.

source: Creating iconic, user-centric designs for commercial, institutional, residential, science and industry, and hospitality projects, including refurbishments, teaching and research spaces, and inclusive, accessible environments..
de: Ikonische, benutzerzentrierte Designs für kommerzielle, institutionelle, private, wissenschaftliche und industrielle sowie gastgewerbliche Projekte schaffen, einschließlich Renovierungen, Lehr- und Forschungsräumen sowie inklusiven, zugänglichen Umgebungen.
fr: Créer des designs emblématiques et centrés sur l'utilisateur pour des projets commerciaux, institutionnels, résidentiels, scientifiques et industriels, et hôteliers, y compris des rénovations, des espaces d'enseignement et de recherche, et des environnements inclusifs et accessibles.

source: Delivering robust structural, mechanical, civil, and bridge engineering, with a focus on efficiency and resilience.
de: Robuste Struktur-, Maschinen-, Bau- und Brückentechnik mit Fokus auf Effizienz und Widerstandsfähigkeit liefern.
fr: Fournir une ingénierie structurelle, mécanique, civile et des ponts robuste, en mettant l'accent sur l'efficacité et la résilience.

source: Designing sustainable, smart cities, urban frameworks, and campus energy masterplans, integrating intelligent mobility.
de: Nachhaltige Smart Cities, städtische Rahmenpläne und Campus-Energie-Masterpläne entwerfen, die intelligente Mobilität integrieren.
fr: Concevoir des villes intelligentes durables, des cadres urbains et des plans directeurs énergétiques de campus, intégrant une mobilité intelligente.

source: Guiding clients towards net-zero goals with ESG strategies, environmental consulting, nature-based solutions and certifications like EDGE.
de: Kunden zu Netto-Null-Zielen führen mit ESG-Strategien, Umweltberatung, naturbasierten Lösungen und Zertifizierungen wie EDGE.
fr: Guider les clients vers des objectifs net-zéro avec des stratégies ESG, du conseil environnemental, des solutions basées sur la nature et des certifications comme EDGE.

source: Utilizing BIM, digital twinning, and parametric design for creating lighting design, night-time design, and immersive experience design for cultural, public, and event spaces, including major event overlay design.
de: BIM, digitale Zwillinge und parametrisches Design nutzen, um Lichtdesign, Nachtdesign und immersives Erlebnisdesign für kulturelle, öffentliche und Veranstaltungsräume zu schaffen, einschließlich großer Event-Overlay-Designs.
fr: Utiliser le BIM, le jumeau numérique et la conception paramétrique pour créer des conceptions d'éclairage, de conception nocturne et d'expérience immersive pour des espaces culturels, publics et événementiels, y compris la conception de superposition d'événements majeurs.

source: Designing standout interiors and landscape to support the building taking into consideration sustainability,and saint gobain comfort goals.
de: Herausragende Innenräume und Landschaften gestalten, um das Gebäude unter Berücksichtigung von Nachhaltigkeit und Saint Gobain Komfortzielen zu unterstützen.
fr: Concevoir des intérieurs et des paysages remarquables pour soutenir le bâtiment en tenant compte de la durabilité et des objectifs de confort Saint Gobain.

source: Employing agile methodologies for client-centric project management, alongside innovative product design and sustainable material specification.
de: Agile Methoden für kundenorientiertes Projektmanagement einsetzen, zusammen mit innovativem Produktdesign und nachhaltiger Materialspezifikation.
fr: Employer des méthodologies agiles pour la gestion de projet centrée sur le client, ainsi que la conception innovante de produits et la spécification de matériaux durables.

source: Offering expertise in specialized services such as retrofit, at scale, research, and organizational development to support diverse project needs.
de: Expertise in spezialisierten Dienstleistungen wie Nachrüstung, in großem Maßstab, Forschung und Organisationsentwicklung anbieten, um vielfältige Projektanforderungen zu unterstützen.
fr: Offrir une expertise dans des services spécialisés tels que la rénovation, à grande échelle, la recherche et le développement organisationnel pour soutenir divers besoins de projets.

source: Beach House — A stunning coastal residence blending modern design with natural surroundings
de: Strandhaus — Eine atemberaubende Küstenresidenz, die modernes Design mit natürlicher Umgebung verbindet
fr: Maison de Plage — Une résidence côtière époustouflante alliant design moderne et environnement naturel

source: First Love Center — A contemporary community center providing versatile spaces for worship and social gatherings
de: First Love Zentrum — Ein zeitgenössisches Gemeindezentrum mit vielseitigen Räumen für Gottesdienst und soziale Zusammenkünfte
fr: Centre First Love — Un centre communautaire contemporain offrant des espaces polyvalents pour le culte et les rassemblements sociaux

source: NetZero House — An innovative eco-friendly home designed for sustainable living
de: NetZero Haus — Ein innovatives umweltfreundliches Haus für nachhaltiges Wohnen
fr: Maison NetZero — Une maison écologique innovante conçue pour une vie durable

source: The Exchange Apartments — Modern residential apartments offering comfortable living spaces with panoramic views
de: Die Exchange Apartments — Moderne Wohnanlagen mit komfortablen Wohnräumen und Panoramablick
fr: Appartements The Exchange — Appartements résidentiels modernes offrant des espaces de vie confortables avec vue panoramique

source: Volta Region, Ghana
fr: Région de la Volta, Ghana

source: Contact us
de: Kontaktieren Sie uns
fr: Contactez-nous

source: Business enquiries
de: Geschäftliche Anfragen
fr: Demandes commerciales

source: Speak to an Arup expert about a project, service, or partnership enquiry.
de: Sprechen Sie mit einem Arup-Experten über ein Projekt, eine Dienstleistung oder eine Partnerschaftsanfrage.
fr: Parlez à un expert d'Arup pour une demande de projet, de service ou de partenariat.

source: Area of business
de: Geschäftsbereich
fr: Domaine d'activité

source: Select...
de: Auswählen...
fr: Sélectionner...

source: Buildings
de: Gebäude
fr: Bâtiments

source: Energy
de: Energie
fr: Énergie

source: Water
de: Wasser
fr: Eau

source: Environment
de: Umwelt
fr: Environnement

source: Cities & Urban Design
de: Städte & Stadtgestaltung
fr: Villes et design urbain

source: Digital & Technology
de: Digital & Technologie
fr: Digital et technologie

source: Advisory
de: Beratung
fr: Conseil

source: Health
de: Gesundheit
fr: Santé

source: Education
de: Bildung
fr: Éducation

source: Defence
de: Verteidigung
fr: Défense

source: Mining
de: Bergbau
fr: Mines

source: Property & Real Estate
de: Immobilien & Grundbesitz
fr: Immobilier

source: Select your service of interest (if known)
de: Wählen Sie Ihren interessierenden Service (falls bekannt)
fr: Sélectionnez votre service d'intérêt (si connu)

source: How did you hear about us?
de: Wie haben Sie von uns erfahren?
fr: Comment avez-vous entendu parler de nous ?

source: Social Media
de: Soziale Medien
fr: Réseaux sociaux

source: Website
de: Webseite
fr: Site web

source: Referral
de: Empfehlung
fr: Référence

source: Advertisement
de: Werbung
fr: Publicité

source: Job Board
de: Jobportal
fr: Site d'emploi

source: University/Career Fair
de: Universität/Karrieremesse
fr: Université/Salon de l'emploi

source: Networking Event
fr: Événement de réseautage

source: Other
de: Sonstiges
fr: Autre

source: First name
de: Vorname
fr: Prénom

source: Last name
de: Nachname
fr: Nom

source: Email address
de: E-Mail-Adresse
fr: Adresse e-mail

source: Phone number
de: Telefonnummer
fr: Numéro de téléphone

source: Company name
de: Firmenname
fr: Nom de l'entreprise

source: Job title
de: Berufsbezeichnung
fr: Titre du poste

source: Country/Location
de: Land/Standort
fr: Pays/Lieu

source: Select
de: Auswählen
fr: Sélectionner

source: United Kingdom
de: Vereinigtes Königreich
fr: Royaume-Uni

source: United States
de: Vereinigte Staaten
fr: États-Unis

source: Australia
de: Australien
fr: Australie

source: Ireland
de: Irland
fr: Irlande

source: Germany
de: Deutschland
fr: Allemagne

source: Netherlands
de: Niederlande
fr: Pays-Bas

source: Spain
de: Spanien
fr: Espagne

source: Italy
de: Italien
fr: Italie

source: Sweden
de: Schweden
fr: Suède

source: Norway
de: Norwegen
fr: Norvège

source: Denmark
de: Dänemark
fr: Danemark

source: Finland
de: Finnland
fr: Finlande

source: Belgium
de: Belgien
fr: Belgique

source: Switzerland
de: Schweiz
fr: Suisse

source: Austria
de: Österreich
fr: Autriche

source: Poland
de: Polen
fr: Pologne

source: Greece
de: Griechenland
fr: Grèce

source: Turkey
de: Türkei
fr: Turquie

source: Russia
de: Russland
fr: Russie

source: China
fr: Chine

source: India
de: Indien
fr: Inde

source: Japan
fr: Japon

source: South Korea
de: Südkorea
fr: Corée du Sud

source: Singapore
de: Singapur
fr: Singapour

source: Hong Kong SAR
fr: Hong Kong RAS

source: United Arab Emirates
de: Vereinigte Arabische Emirate
fr: Émirats arabes unis

source: Saudi Arabia
de: Saudi-Arabien
fr: Arabie saoudite

source: South Africa
de: Südafrika
fr: Afrique du Sud

source: Egypt
de: Ägypten
fr: Égypte

source: Brazil
de: Brasilien
fr: Brésil

source: Mexico
de: Mexiko
fr: Mexique

source: Argentina
de: Argentinien
fr: Argentine

source: Chile
fr: Chili

source: Colombia
de: Kolumbien
fr: Colombie

source: New Zealand
de: Neuseeland
fr: Nouvelle-Zélande

source: City/Town
de: Stadt
fr: Ville

source: What would you like to discuss?
de: Worüber möchten Sie sprechen?
fr: De quoi aimeriez-vous discuter ?

source: Media and press
de: Medien und Presse
fr: Médias et presse

source: Speak to our communications team about any media or press correspondence.
de: Sprechen Sie mit unserem Kommunikationsteam über Medien- oder Pressekorrespondenz.
fr: Parlez à notre équipe de communication pour toute correspondance médiatique ou de presse.

source: Speak to Arup's recruitment teams about job opportunities and careers. Before sending a general enquiry, kindly review our application process to see if your question has already been addressed.
de: Sprechen Sie mit den Rekrutierungsteams von Arup über Jobmöglichkeiten und Karrieren. Bevor Sie eine allgemeine Anfrage senden, überprüfen Sie bitte unseren Bewerbungsprozess, um zu sehen, ob Ihre Frage bereits beantwortet wurde.
fr: Parlez aux équipes de recrutement d'Arup des opportunités d'emploi et de carrière. Avant d'envoyer une demande générale, veuillez consulter notre processus de candidature pour voir si votre question a déjà été traitée.

source: Experience level
de: Erfahrungsniveau
fr: Niveau d'expérience

source: Internship
de: Praktikum
fr: Stage

source: Entry Level
de: Einstiegsniveau
fr: Niveau débutant

source: Mid Level
de: Mittleres Niveau
fr: Niveau intermédiaire

source: Senior Level
de: Senior-Niveau
fr: Niveau senior

source: Executive
de: Führungskraft
fr: Cadre supérieur

source: Graduate
de: Absolvent
fr: Diplômé

source: Arup will only process your data in accordance with its
de: Arup wird Ihre Daten nur in Übereinstimmung mit seiner
fr: Arup ne traitera vos données que conformément à sa

source: privacy policy
de: Datenschutzerklärung
fr: politique de confidentialité

source: Speak to us about anything else.
de: Sprechen Sie mit uns über alles andere.
fr: Parlez-nous de tout autre sujet.

source: Your nearest office
de: Ihr nächstes Büro
fr: Votre bureau le plus proche

source: Contact office
de: Büro kontaktieren
fr: Contacter le bureau

source: We use cookies to enhance your browsing experience, serve personalized content, and analyze our traffic. By clicking "Accept All", you consent to our use of cookies.
de: Wir verwenden Cookies, um Ihr Surferlebnis zu verbessern, personalisierte Inhalte bereitzustellen und unseren Traffic zu analysieren. Durch Klicken auf "Alle akzeptieren" stimmen Sie unserer Verwendung von Cookies zu.
fr: Nous utilisons des cookies pour améliorer votre expérience de navigation, diffuser du contenu personnalisé et analyser notre trafic. En cliquant sur "Tout accepter", vous consentez à notre utilisation des cookies.

source: Accept All
de: Alle akzeptieren
fr: Tout accepter

source: Reject All
de: Alle ablehnen
fr: Tout rejeter

source: Customize
de: Anpassen
fr: Personnaliser

source: Cookie Preferences
de: Cookie-Einstellungen
fr: Préférences des cookies

source: Essential Cookies
de: Notwendige Cookies
fr: Cookies essentiels
